NXP-MCU-X-Lab/lpc_uart_server/mcu_source/Libraries/startup/inc/LPC84x.h
#define DAC1_IRQn   PININT5_IRQn            // Pin int. 5 shared slot with DAC1
#define UART3_IRQn  PININT6_IRQn            // Pin int. 6 shared slot with UART3
#define UART4_IRQn  PININT7_IRQn            // Pin int. 7 shared slot with UART4

/*
 * ==========================================================================
 * ----------- Processor and Core Peripheral Section ------------------------
 * ==========================================================================
 */

/* Configuration of the Cortex-M0+ Processor and Core Peripherals */
#define __CM0PLUS_REV             0x0001
#define __MPU_PRESENT             0         /*!< MPU present or not                               */
#define __NVIC_PRIO_BITS          2         /*!< Number of Bits used for Priority Levels          */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used     */

/*@}*/ /* end of group LPC8xx_CMSIS */


#include "core_cm0plus.h"                  /* Cortex-M0+ processor and core peripherals          */
#include "system_LPC8xx.h"                 /* System Header                                      */

/* ARM 24.04.2017 */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #  warning Not supported compiler type
#endif

/******************************************************************************/
/*                Device Specific Peripheral Registers structures             */
/******************************************************************************/

//------------- System Control (SYSCON) --------------------------------------
typedef struct
{
  __IO uint32_t SYSMEMREMAP         ; ///< (0x000) System memory remap
  __IO uint32_t RESERVED0[1]        ; ///< (0x004)
  __IO uint32_t SYSPLLCTRL          ; ///< (0x008) System PLL control
  __I  uint32_t SYSPLLSTAT          ; ///< (0x00C) System PLL status
  __IO uint32_t RESERVED1[4]        ; ///< (0x010 - 0x01C)
  __IO uint32_t SYSOSCCTRL          ; ///< (0x020) System oscillator control
  __IO uint32_t WDTOSCCTRL          ; ///< (0x024) Watchdog oscillator control
  __IO uint32_t FROOSCCTRL          ; ///< (0x028) FRO oscillator control 
  __IO uint32_t RESERVED2[1]        ; ///< (0x02C)
  __IO uint32_t FRODIRECTCLKUEN     ; ///< (0x030) FRO direct clock source update
  __IO uint32_t RESERVED3[1]        ; ///< (0x034)
  __IO uint32_t SYSRSTSTAT          ; ///< (0x038) System reset status 0
  __IO uint32_t FAIMCTRL            ; ///< (0x03C) FAIM row protect control 0xFF
  __IO uint32_t SYSPLLCLKSEL        ; ///< (0x040) System PLL clock source select 0
  __IO uint32_t SYSPLLCLKUEN        ; ///< (0x044) System PLL clock source update
  __IO uint32_t MAINCLKPLLSEL       ; ///< (0x048) Main clock pll source select 0
  __IO uint32_t MAINCLKPLLUEN       ; ///< (0x04C) Main clock pll source update enable
  __IO uint32_t MAINCLKSEL          ; ///< (0x050) Main clock source select
  __IO uint32_t MAINCLKUEN          ; ///< (0x054) Main clock source update enable
  __IO uint32_t SYSAHBCLKDIV        ; ///< (0x058) System clock divider
  __IO uint32_t RESERVED4[1]        ; ///< (0x05C)
  __IO uint32_t RESERVED4a[1]       ; ///< (0x060) 
  __IO uint32_t ADCCLKSEL           ; ///< (0x064) ADC clock source select
  __IO uint32_t ADCCLKDIV           ; ///< (0x068) ADC clock divider
  __IO uint32_t SCTCLKSEL           ; ///< (0x06C) SCT clock source select
  __IO uint32_t SCTCLKDIV           ; ///< (0x070) SCT clock divider
  __IO uint32_t EXTCLKSEL           ; ///< (0x074) External clock source select
  __IO uint32_t RESERVED5[2]        ; ///< (0x078 - 0x07C)
  union {
    __IO uint32_t SYSAHBCLKCTRL[2]  ;
    struct {
    __IO uint32_t SYSAHBCLKCTRL0    ; ///< (0x080) System clock group 0 control
    __IO uint32_t SYSAHBCLKCTRL1    ; ///< (0x084) System clock group 1 control
    };
  };
  union {
    __IO uint32_t PRESETCTRL[2]     ;
    struct {
    __IO uint32_t PRESETCTRL0       ; ///< (0x088) Peripheral reset group 0 control
    __IO uint32_t PRESETCTRL1       ; ///< (0x08C) Peripheral reset group 1 control
    };
  };
  union {
    __IO uint32_t FCLKSEL[11]       ;
    struct {
      __IO uint32_t UART0CLKSEL     ; ///< (0x090) FCLK0 clock source select
      __IO uint32_t UART1CLKSEL     ; ///< (0x094) FCLK1 clock source select
      __IO uint32_t UART2CLKSEL     ; ///< (0x098) FCLK2 clock source select
      __IO uint32_t UART3CLKSEL     ; ///< (0x09C) FCLK3 clock source select
      __IO uint32_t UART4CLKSEL     ; ///< (0x0A0) FCLK4 clock source select
      __IO uint32_t I2C0CLKSEL      ; ///< (0x0A4) FCLK5 clock source select
      __IO uint32_t I2C1CLKSEL      ; ///< (0x0A8) FCLK6 clock source select
      __IO uint32_t I2C2CLKSEL      ; ///< (0x0AC) FCLK7 clock source select
      __IO uint32_t I2C3CLKSEL      ; ///< (0x0B0) FCLK8 clock source select
      __IO uint32_t SPI0CLKSEL      ; ///< (0x0B4) FCLK9 clock source select
      __IO uint32_t SPI1CLKSEL      ; ///< (0x0B8) FCLK10 clock source select
    };
  }; 
  __IO uint32_t RESERVED6[1]        ; ///< (0x0BC)
  __IO uint32_t EFLASHREFCLKDIV     ; ///< (0x0C0) EFLASH reference clock divider
  __IO uint32_t FAIMREFCLKDIV       ; ///< (0x0C4) FAIM reference clock divider
  __IO uint32_t RESERVED7[2]        ; ///< (0x0C8 - 0x0CC)
  __IO uint32_t FRG0DIV             ; ///< (0x0D0) Fractional generator divider value
  __IO uint32_t FRG0MULT            ; ///< (0x0D4) Fractional generator multiplier value
  __IO uint32_t FRG0CLKSEL          ; ///< (0x0D8) FRG0 clock source select
  __IO uint32_t RESERVED8[1]        ; ///< (0x0DC)
  __IO uint32_t FRG1DIV             ; ///< (0x0E0) Fractional generator divider value
  __IO uint32_t FRG1MULT            ; ///< (0x0E4) Fractional generator multiplier value
  __IO uint32_t FRG1CLKSEL          ; ///< (0x0E8) FRG1 clock source select
  __IO uint32_t RESERVED9[1]        ; ///< (0x0EC)
  __IO uint32_t CLKOUTSEL           ; ///< (0x0F0) CLKOUT clock source select
  __IO uint32_t CLKOUTDIV           ; ///< (0x0F4) CLKOUT clock divider
  __IO uint32_t RESERVED10[1]       ; ///< (0x0F8)
  __IO uint32_t EXTTRACECMD         ; ///< (0x0FC) External trace buffer command
  __I  uint32_t PIOPORCAP0          ; ///< (0x100) POR captured PIO0 status 0
  __I  uint32_t PIOPORCAP1          ; ///< (0x104) POR captured PIO1 status 0
  __IO uint32_t RESERVED11[11]      ; ///< (0x108 - 0x130)
  __IO uint32_t IOCONCLKDIV6        ; ///< (0x134) Peripheral clock 6 to the IOCON block for programmable glitch filter
  __IO uint32_t IOCONCLKDIV5        ; ///< (0x138) Peripheral clock 5 to the IOCON block for programmable glitch filter
  __IO uint32_t IOCONCLKDIV4        ; ///< (0x13C) Peripheral clock 4 to the IOCON block for programmable glitch filter
  __IO uint32_t IOCONCLKDIV3        ; ///< (0x140) Peripheral clock 3 to the IOCON block for programmable glitch filter
  __IO uint32_t IOCONCLKDIV2        ; ///< (0x144) Peripheral clock 2 to the IOCON block for programmable glitch filter
  __IO uint32_t IOCONCLKDIV1        ; ///< (0x148) Peripheral clock 1 to the IOCON block for programmable glitch filter
  __IO uint32_t IOCONCLKDIV0        ; ///< (0x14C) Peripheral clock 0 to the IOCON block for programmable glitch filter
  __IO uint32_t BODCTRL             ; ///< (0x150) Brown-Out Detect
  __IO uint32_t SYSTCKCAL           ; ///< (0x154) System tick counter calibration
  __IO uint32_t RESERVED12[6]       ; ///< (0x158 - 0x16C)
  __IO uint32_t IRQLATENCY          ; ///< (0x170) IRQ delay. Allows trade-off between interrupt latency and determinism.
  __IO uint32_t NMISRC              ; ///< (0x174) NMI Source Control
  union {
    __IO uint32_t PINTSEL[8]        ;
    struct {
    __IO uint32_t PINTSEL0          ; ///< (0x178) GPIO Pin Interrupt Select 0
    __IO uint32_t PINTSEL1          ; ///< (0x17C) GPIO Pin Interrupt Select 1
    __IO uint32_t PINTSEL2          ; ///< (0x180) GPIO Pin Interrupt Select 2
    __IO uint32_t PINTSEL3          ; ///< (0x184) GPIO Pin Interrupt Select 3
    __IO uint32_t PINTSEL4          ; ///< (0x188) GPIO Pin Interrupt Select 4
    __IO uint32_t PINTSEL5          ; ///< (0x18C) GPIO Pin Interrupt Select 5
    __IO uint32_t PINTSEL6          ; ///< (0x190) GPIO Pin Interrupt Select 6
    __IO uint32_t PINTSEL7          ; ///< (0x194) GPIO Pin Interrupt Select 7
    };
  };
  __IO uint32_t RESERVED13[27]      ; ///< (0x198 - 0x200)
  __IO uint32_t STARTERP0           ; ///< (0x204) Start logic 0 pin wake-up enable
  __IO uint32_t RESERVED14[3]       ; ///< (0x208 - 0x210)
  __IO uint32_t STARTERP1           ; ///< (0x214) Start logic 1 interrupt wake-up enable
  __IO uint32_t RESERVED15[6]       ; ///< (0x218 - 0x22C)
  __IO uint32_t PDSLEEPCFG          ; ///< (0x230) Power-down states in deep-sleep mode
  __IO uint32_t PDAWAKECFG          ; ///< (0x234) Power-down states for wake-up from deep-sleep
  __IO uint32_t PDRUNCFG            ; ///< (0x238) Power configuration
  __IO uint32_t RESERVED16[111]     ; ///< (0x23C - 0x3F4)
  __I  uint32_t DEVICE_ID           ; ///< (0x3F8) Device ID
} LPC_SYSCON_TypeDef;




// ---------------- IOCON ----------------
typedef struct {                            
  __IO uint32_t PIO0_17;                    // 0x00
  __IO uint32_t PIO0_13;                    // 0x04
  __IO uint32_t PIO0_12;                    // 0x08
  __IO uint32_t PIO0_5;                     // 0x0C
  __IO uint32_t PIO0_4;                     // 0x10
  __IO uint32_t PIO0_3;                     // 0x14
  __IO uint32_t PIO0_2;                     // 0x18
  __IO uint32_t PIO0_11;                    // 0x1C
  __IO uint32_t PIO0_10;                    // 0x20
  __IO uint32_t PIO0_16;                    // 0x24
  __IO uint32_t PIO0_15;                    // 0x28
  __IO uint32_t PIO0_1;                     // 0x2C
  __IO uint32_t Reserved0;                  // 0x30
  __IO uint32_t PIO0_9;                     // 0x34
  __IO uint32_t PIO0_8;                     // 0x38
  __IO uint32_t PIO0_7;                     // 0x3C
  __IO uint32_t PIO0_6;                     // 0x40
  __IO uint32_t PIO0_0;                     // 0x44
  __IO uint32_t PIO0_14;                    // 0x48
  __IO uint32_t Reserved1;                  // 0x4C
  __IO uint32_t PIO0_28;                    // 0x50
  __IO uint32_t PIO0_27;                    // 0x54
  __IO uint32_t PIO0_26;                    // 0x58
  __IO uint32_t PIO0_25;                    // 0x5C
  __IO uint32_t PIO0_24;                    // 0x60
  __IO uint32_t PIO0_23;                    // 0x64
  __IO uint32_t PIO0_22;                    // 0x68
  __IO uint32_t PIO0_21;                    // 0x6C
  __IO uint32_t PIO0_20;                    // 0x70
  __IO uint32_t PIO0_19;                    // 0x74
  __IO uint32_t PIO0_18;                    // 0x78
  __IO uint32_t PIO1_8;                     // 0x7C
  __IO uint32_t PIO1_9;                     // 0x80
  __IO uint32_t PIO1_12;                    // 0x84
  __IO uint32_t PIO1_13;                    // 0x88
  __IO uint32_t PIO0_31;                    // 0x8C
  __IO uint32_t PIO1_0;                     // 0x90
  __IO uint32_t PIO1_1;                     // 0x94
  __IO uint32_t PIO1_2;                     // 0x98
  __IO uint32_t PIO1_14;                    // 0x9C
  __IO uint32_t PIO1_15;                    // 0xA0
  __IO uint32_t PIO1_3;                     // 0xA4
  __IO uint32_t PIO1_4;                     // 0xA8
  __IO uint32_t PIO1_5;                     // 0xAC
  __IO uint32_t PIO1_16;                    // 0xB0
  __IO uint32_t PIO1_17;                    // 0xB4
  __IO uint32_t PIO1_6;                     // 0xB8
  __IO uint32_t PIO1_18;                    // 0xBC
  __IO uint32_t PIO1_19;                    // 0xC0
  __IO uint32_t PIO1_7;                     // 0xC4
  __IO uint32_t PIO0_29;                    // 0xC8
  __IO uint32_t PIO0_30;                    // 0xCC
  __IO uint32_t PIO1_20;                    // 0xD0
  __IO uint32_t PIO1_21;                    // 0xD4
  __IO uint32_t PIO1_11;                    // 0xD8
  __IO uint32_t PIO1_10;                    // 0xDC
} LPC_IOCON_TypeDef;




// ================================================================================
// ================                    FLASHCTRL                   ================
// ================================================================================
typedef struct {                         /*!< (@ 0x40040000) FLASHCTRL Structure */
  __I  uint32_t  RESERVED0[4];
  __IO uint32_t  FLASHCFG;               /*!< (@ 0x40040010) Flash configuration register */
  __I  uint32_t  RESERVED1[3];
  __IO uint32_t  FMSSTART;               /*!< (@ 0x40040020) Signature start address register */
  __IO uint32_t  FMSSTOP;                /*!< (@ 0x40040024) Signature stop-address register  */
  __I  uint32_t  RESERVED2;
  __I  uint32_t  FMSW0;                  /*!< (@ 0x4004002C) Signature Word */
} LPC_FLASHCTRL_TypeDef;




