NXP-MCU-X-Lab/lpc_uart_server/mcu_source/Libraries/startup/inc/LPC84x.h
  uint16_t RESERVED8[32 - CONFIG_SCT_nRG];    // ...-0x2FE reserved

  __IO struct {                               // 0x300-0x3FC  EVENT[i].STATE / EVENT[i].CTRL
    uint32_t STATE;
    uint32_t CTRL;
  } EVENT[CONFIG_SCT_nEV];

  uint32_t RESERVED9[128 - (2 * CONFIG_SCT_nEV)]; // ...-0x4FC reserved 

  __IO struct {                               // 0x500-0x57C  OUT[n].SET / OUT[n].CLR 
    uint32_t SET;                             // Output n Set Register 
    uint32_t CLR;                             // Output n Clear Register
  } OUT[CONFIG_SCT_nOU];

  uint32_t RESERVED10[((0x300 / 4) - 1) - (2 * CONFIG_SCT_nOU)]; // ...-0x7F8 reserved 
  
  __I  uint32_t MODULECONTENT;                // 0x7FC Module Content 

} LPC_SCT_TypeDef;








//------------------- Standard Counter/Timer (CTIMER) ---------------------
typedef struct {
  __IO uint32_t IR;               // 0x00
  __IO uint32_t TCR;              // 0x04
  __IO uint32_t TC;               // 0x08
  __IO uint32_t PR;               // 0x0C
  __IO uint32_t PC;               // 0x10
  __IO uint32_t MCR;              // 0x14
  __IO uint32_t MR[4];            // 0x18 - 0x24
  __IO uint32_t CCR;              // 0x28
  __IO uint32_t CR[4];            // 0x2C - 0x38
  __IO uint32_t EMR;              // 0x3C
  __I  uint32_t RESERVED0[12];    // 0x40 - 0x6C 
  __IO uint32_t CTCR;             // 0x70
  __IO uint32_t PWMC;             // 0x74
} LPC_TIMER_TypeDef;






//------------- Widowed Watchdog Timer (WWDT) -----------------------------------------
typedef struct
{
  __IO uint32_t MOD;                    /*!< Offset: 0x000 Watchdog mode register (R/W) */
  __IO uint32_t TC;                     /*!< Offset: 0x004 Watchdog timer constant register (R/W) */
  __O  uint32_t FEED;                   /*!< Offset: 0x008 Watchdog feed sequence register (W) */
  __I  uint32_t TV;                     /*!< Offset: 0x00C Watchdog timer value register (R) */
       uint32_t RESERVED;               /*!< Offset: 0x010 RESERVED                          */
  __IO uint32_t WARNINT;                /*!< Offset: 0x014 Watchdog timer warning int. register (R/W) */
  __IO uint32_t WINDOW;                 /*!< Offset: 0x018 Watchdog timer window value register (R/W) */
} LPC_WWDT_TypeDef;









//-------------------------------------------------------------------------
// Input multiplexing and DMA trigger multiplexing (INPUT MUX, DMA TRIGMUX)
//-------------------------------------------------------------------------
typedef struct {
  __IO uint32_t DMA_INMUX_INMUX0;       // 0x0
  __IO uint32_t DMA_INMUX_INMUX1;       // 0x4
  __I  uint32_t Preserved[6];           // 0x8 - 0x1C
  __IO uint32_t SCT0_INMUX0;            // 0x20
  __IO uint32_t SCT0_INMUX1;            // 0x24
  __IO uint32_t SCT0_INMUX2;            // 0x28
  __IO uint32_t SCT0_INMUX3;            // 0x2C
  __I  uint32_t Severed[4];             // 0x30 - 0x3C
  __IO uint32_t DMA_ITRIG_INMUX0;       // 0x40
  __IO uint32_t DMA_ITRIG_INMUX1;       // 0x44
  __IO uint32_t DMA_ITRIG_INMUX2;       // 0x48
  __IO uint32_t DMA_ITRIG_INMUX3;       // 0x4C
  __IO uint32_t DMA_ITRIG_INMUX4;       // 0x50
  __IO uint32_t DMA_ITRIG_INMUX5;       // 0x54
  __IO uint32_t DMA_ITRIG_INMUX6;       // 0x58
  __IO uint32_t DMA_ITRIG_INMUX7;       // 0x5C
  __IO uint32_t DMA_ITRIG_INMUX8;       // 0x60
  __IO uint32_t DMA_ITRIG_INMUX9;       // 0x64
  __IO uint32_t DMA_ITRIG_INMUX10;      // 0x68
  __IO uint32_t DMA_ITRIG_INMUX11;      // 0x6C
  __IO uint32_t DMA_ITRIG_INMUX12;      // 0x70
  __IO uint32_t DMA_ITRIG_INMUX13;      // 0x74
  __IO uint32_t DMA_ITRIG_INMUX14;      // 0x78
  __IO uint32_t DMA_ITRIG_INMUX15;      // 0x7C
  __IO uint32_t DMA_ITRIG_INMUX16;      // 0x80
  __IO uint32_t DMA_ITRIG_INMUX17;      // 0x84
  __IO uint32_t DMA_ITRIG_INMUX18;      // 0x88
  __IO uint32_t DMA_ITRIG_INMUX19;      // 0x8C
  __IO uint32_t DMA_ITRIG_INMUX20;      // 0x90
  __IO uint32_t DMA_ITRIG_INMUX21;      // 0x94
  __IO uint32_t DMA_ITRIG_INMUX22;      // 0x98
  __IO uint32_t DMA_ITRIG_INMUX23;      // 0x9C
  __IO uint32_t DMA_ITRIG_INMUX24;      // 0xA0
} LPC_INMUX_TRIGMUX_TypeDef;






//------------- ADC -----------------------------------------
typedef struct {
  __IO uint32_t CTRL;           // 0x0
       uint32_t RESERVED0;      // 0x4
  __IO uint32_t SEQA_CTRL;      // 0x8
  __IO uint32_t SEQB_CTRL;      // 0xC
  __IO uint32_t SEQA_GDAT;      // 0x10
  __IO uint32_t SEQB_GDAT;      // 0x14
       uint32_t RESERVED1[2];   // 0x18 - 0x1C
  __IO uint32_t DAT[12];        // 0x20 - 0x4C
  __IO uint32_t THR0_LOW;       // 0x50
  __IO uint32_t THR1_LOW;       // 0x54
  __IO uint32_t THR0_HIGH;      // 0x58
  __IO uint32_t THR1_HIGH;      // 0x5C
  __IO uint32_t CHAN_THRSEL;    // 0x60
  __IO uint32_t INTEN;          // 0x64
  __IO uint32_t FLAGS;          // 0x68
  __IO uint32_t TRM;            // 0x6C
} LPC_ADC_TypeDef;






//------------- DMA -----------------------------------------
#define NUM_DMA_CHANNELS 25

typedef struct {
  __IO uint32_t  CFG;
  __I  uint32_t  CTLSTAT;
  __IO uint32_t  XFERCFG;
  __I  uint32_t  RESERVED;
} LPC_DMA_CHANNEL_T;

typedef struct {
  __IO uint32_t  CTRL;                          // 0x0
  __I  uint32_t  INTSTAT;                       // 0x4
  __IO uint32_t  SRAMBASE;                      // 0x8
  __I  uint32_t  Reserved0[5];                  // 0x10 - 0x1C
  __IO uint32_t  ENABLESET0;                    // 0x20
  __I  uint32_t  Reserved1;                     // 0x24
  __O  uint32_t  ENABLECLR0;                    // 0x28
  __I  uint32_t  Reserved2;                     // 0x2C
  __I  uint32_t  ACTIVE0;                       // 0x30
  __I  uint32_t  Reserved3;                     // 0x34
  __I  uint32_t  BUSY0;                         // 0x38
  __I  uint32_t  Reserved4;                     // 0x3C
  __IO uint32_t  ERRINT0;                       // 0x40
  __I  uint32_t  Reserved5;                     // 0x44
  __IO uint32_t  INTENSET0;                     // 0x48
  __I  uint32_t  Reserved6;                     // 0x4C
  __O  uint32_t  INTENCLR0;                     // 0x50
  __I  uint32_t  Reserved7;                     // 0x54
  __IO uint32_t  INTA0;                         // 0x58
  __I  uint32_t  Reserved8;                     // 0x5C
  __IO uint32_t  INTB0;                         // 0x60
  __I  uint32_t  Reserved9;                     // 0x64
  __O  uint32_t  SETVALID0;                     // 0x68
  __I  uint32_t  Reserved10;                    // 0x6C
  __O  uint32_t  SETTRIG0;                      // 0x70
  __I  uint32_t  Reserved11;                    // 0x74
  __O  uint32_t  ABORT0;                        // 0x78
  __I  uint32_t  Absolutely_Nothing[225];       // 0x7C - 0x3FC
  LPC_DMA_CHANNEL_T CHANNEL[NUM_DMA_CHANNELS];  // 0x400 - 0xThe_End
} LPC_DMA_TypeDef;






