NXP-MCU-X-Lab/lpc_uart_server/mcu_source/Libraries/startup/inc/LPC84x.h
//------------- DAC ----------------
typedef struct {
  __IO uint32_t CR;             // 0x00
  __IO uint32_t CTRL;           // 0x04
  __IO uint32_t CNTVAL;         // 0x08
} LPC_DAC_TypeDef;






//------------------------ FAIM Controller -------------------------
typedef struct {
  __IO uint32_t  EECMD;           // 0x00
  __I  uint32_t  Reserved0;       // 0x04
  __IO uint32_t  EERWSTATE;       // 0x08
  __IO uint32_t  EEPAUTOPROG;     // 0x0C
  __IO uint32_t  EEWSTATE;        // 0x10
  __IO uint32_t  EECLKDIV;        // 0x14
  __IO uint32_t  EEPWRDWN;        // 0x18
  __IO uint32_t  EEMSSTART;       // 0x20
  __IO uint32_t  EEMSSTOP;        // 0x24
  __I  uint32_t  EEMSDATASIG;     // 0x28
  __I  uint32_t  EEMSPARSIG;      // 0x2C
  __IO uint32_t  EEFEATURE;       // 0x30
  __I  uint32_t  EESTATUS;        // 0x34
  __IO uint32_t  ECCRSTERRCNT;    // 0x38
  __I  uint32_t  ECCERRCNT;       // 0x3C
  __I  uint32_t  Reserved1[5];    // 0x40 - 0x50
  __IO uint32_t  EECLKDIV1;       // 0x54
  __IO uint32_t  EECLKDIV2;       // 0x58
  __I  uint32_t  Reserved2[5];    // 0x5C - 0x6C
  __O  uint32_t  EEADDR;          // 0x70
  __I  uint32_t  Reserved3[3];    // 0x74 - 0x7C
  __O  uint32_t  EEWDATA;         // 0x80
  __I  uint32_t  Reserved4;       // 0x84
  __I  uint32_t  EERDATA;         // 0x88
} LPC_FAIMCTRL_TypeDef;


/* ARM 24.04.2017 */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif

/******************************************************************************/
/*                         Peripheral memory map                              */
/******************************************************************************/
// Base addresses                                                             
#define LPC_FLASH_BASE         (0x00000000UL)
#define LPC_RAM_BASE           (0x10000000UL)
#define LPC_ROM_BASE           (0x1FFF0000UL)
#define LPC_APB0_BASE          (0x40000000UL)
#define LPC_AHB_BASE           (0x50000000UL)

// APB0 peripherals 
#define LPC_WWDT_BASE          (LPC_APB0_BASE + 0x00000)
#define LPC_MRT_BASE           (LPC_APB0_BASE + 0x04000)
#define LPC_WKT_BASE           (LPC_APB0_BASE + 0x08000)
#define LPC_SWM_BASE           (LPC_APB0_BASE + 0x0C000)
#define LPC_FAIMCTRL_BASE      (LPC_APB0_BASE + 0x10000)
#define LPC_DAC0_BASE          (LPC_APB0_BASE + 0x14000)
#define LPC_DAC1_BASE          (LPC_APB0_BASE + 0x18000)
#define LPC_ADC_BASE           (LPC_APB0_BASE + 0x1C000)
#define LPC_PMU_BASE           (LPC_APB0_BASE + 0x20000)
#define LPC_CMP_BASE           (LPC_APB0_BASE + 0x24000)
//                             (LPC_APB0_BASE + 0x28000)
#define LPC_INMUX_TRIGMUX_BASE (LPC_APB0_BASE + 0x2C000)
#define LPC_I2C2_BASE          (LPC_APB0_BASE + 0x30000)
#define LPC_I2C3_BASE          (LPC_APB0_BASE + 0x34000)
#define LPC_CTIMER0_BASE       (LPC_APB0_BASE + 0x38000)
//                             (LPC_APB0_BASE + 0x38000)
#define LPC_FLASHCTRL_BASE     (LPC_APB0_BASE + 0x40000)
#define LPC_IOCON_BASE         (LPC_APB0_BASE + 0x44000)
#define LPC_SYSCON_BASE        (LPC_APB0_BASE + 0x48000)
#define LPC_I2C0_BASE          (LPC_APB0_BASE + 0x50000)
#define LPC_I2C1_BASE          (LPC_APB0_BASE + 0x54000)
#define LPC_SPI0_BASE          (LPC_APB0_BASE + 0x58000)
#define LPC_SPI1_BASE          (LPC_APB0_BASE + 0x5C000)
//                             (LPC_APB0_BASE + 0x60000)
#define LPC_USART0_BASE        (LPC_APB0_BASE + 0x64000)
#define LPC_USART1_BASE        (LPC_APB0_BASE + 0x68000)
#define LPC_USART2_BASE        (LPC_APB0_BASE + 0x6C000)
#define LPC_USART3_BASE        (LPC_APB0_BASE + 0x70000)
#define LPC_USART4_BASE        (LPC_APB0_BASE + 0x74000)

// AHB peripherals
#define LPC_CRC_BASE           (LPC_AHB_BASE + 0x00000)
#define LPC_SCT_BASE           (LPC_AHB_BASE + 0x04000)
#define LPC_DMA_BASE           (LPC_AHB_BASE + 0x08000)
#define LPC_MTB_SFR_BASE       (LPC_AHB_BASE + 0x0C000)
#define LPC_FAIM_BASE          (LPC_AHB_BASE + 0x10000)
#define LPC_GPIO_PORT_BASE     (0xA0000000)
#define LPC_PIN_INT_BASE       (LPC_GPIO_PORT_BASE + 0x4000)

/******************************************************************************/
/*                         Peripheral declarations                            */
/******************************************************************************/

#define LPC_WWDT              ((LPC_WWDT_TypeDef   *) LPC_WWDT_BASE  )
#define LPC_MRT               ((LPC_MRT_TypeDef    *) LPC_MRT_BASE   )
#define LPC_WKT               ((LPC_WKT_TypeDef    *) LPC_WKT_BASE   )
#define LPC_SWM               ((LPC_SWM_TypeDef    *) LPC_SWM_BASE   )
#define LPC_FAIMCTRL          ((LPC_FAIMCTRL_TypeDef *) LPC_FAIMCTRL_BASE)
#define LPC_DAC0              ((LPC_DAC_TypeDef    *) LPC_DAC0_BASE  )
#define LPC_DAC1              ((LPC_DAC_TypeDef    *) LPC_DAC1_BASE  )
#define LPC_ADC               ((LPC_ADC_TypeDef    *) LPC_ADC_BASE   )
#define LPC_PMU               ((LPC_PMU_TypeDef    *) LPC_PMU_BASE   )
#define LPC_CMP               ((LPC_CMP_TypeDef    *) LPC_CMP_BASE   )
#define LPC_INMUX_TRIGMUX     ((LPC_INMUX_TRIGMUX_TypeDef *) LPC_INMUX_TRIGMUX_BASE)
#define LPC_I2C2              ((LPC_I2C_TypeDef    *) LPC_I2C2_BASE  )
#define LPC_I2C3              ((LPC_I2C_TypeDef    *) LPC_I2C3_BASE  )
#define LPC_CTIMER0           ((LPC_TIMER_TypeDef  *) LPC_CTIMER0_BASE  )
#define LPC_FLASHCTRL         ((LPC_FLASHCTRL_TypeDef *) LPC_FLASHCTRL_BASE )
#define LPC_IOCON             ((LPC_IOCON_TypeDef  *) LPC_IOCON_BASE )
#define LPC_SYSCON            ((LPC_SYSCON_TypeDef *) LPC_SYSCON_BASE)
#define LPC_I2C0              ((LPC_I2C_TypeDef    *) LPC_I2C0_BASE  )
#define LPC_I2C1              ((LPC_I2C_TypeDef    *) LPC_I2C1_BASE  )
#define LPC_SPI0              ((LPC_SPI_TypeDef    *) LPC_SPI0_BASE  )
#define LPC_SPI1              ((LPC_SPI_TypeDef    *) LPC_SPI1_BASE  )

#define LPC_USART0            ((LPC_USART_TypeDef   *) LPC_USART0_BASE )
#define LPC_USART1            ((LPC_USART_TypeDef   *) LPC_USART1_BASE )
#define LPC_USART2            ((LPC_USART_TypeDef   *) LPC_USART2_BASE )
#define LPC_USART3            ((LPC_USART_TypeDef   *) LPC_USART3_BASE )
#define LPC_USART4            ((LPC_USART_TypeDef   *) LPC_USART4_BASE )

#define LPC_CRC               ((LPC_CRC_TypeDef    *) LPC_CRC_BASE   )
#define LPC_SCT               ((LPC_SCT_TypeDef    *) LPC_SCT_BASE   )
#define LPC_SCT0              ((LPC_SCT_TypeDef    *) LPC_SCT_BASE   )
#define LPC_DMA               ((LPC_DMA_TypeDef    *) LPC_DMA_BASE   )
#define LPC_GPIO_PORT         ((LPC_GPIO_PORT_TypeDef  *) LPC_GPIO_PORT_BASE  )
#define LPC_PIN_INT           ((LPC_PIN_INT_TypeDef   *) LPC_PIN_INT_BASE  )





///////////////////////////////////////////////////////////////////////////////
// Other chip-specific macro definitions (a.k.a. the chip.h section)
///////////////////////////////////////////////////////////////////////////////

// ACMP_I-to-IOCON mapping
#define ACMP_I1_PORT PIO0_0
#define ACMP_I2_PORT PIO0_1
#define ACMP_I3_PORT PIO0_14
#define ACMP_I4_PORT PIO0_23
#define ACMP_I5_PORT PIO0_30


#ifdef __cplusplus
}
#endif

#endif  /* __LPC84x_H__ */
